{
  "id": "EUVD-2026-5009",
  "enisaUuid": "501b5c1e-1b4c-3a81-8999-2e6f15d2530f",
  "description": "PsySH is a runtime developer console, interactive debugger, and REPL for PHP. Prior to versions 0.11.23 and 0.12.19, PsySH automatically loads and executes a `.psysh.php` file from the Current Working Directory (CWD) on startup. If an attacker can write to a directory that a victim later uses as their CWD when launching PsySH, the attacker can trigger arbitrary code execution in the victim's context. When the victim runs PsySH with elevated privileges (e.g., root), this results in local privilege escalation. This is a CWD configuration poisoning issue leading to arbitrary code execution in the victim user’s context. If a privileged user (e.g., root, a CI runner, or an ops/debug account) launches PsySH with CWD set to an attacker-writable directory containing a malicious `.psysh.php`, the attacker can execute commands with that privileged user’s permissions, resulting in local privilege escalation. Downstream consumers that embed PsySH inherit this risk. For example, Laravel Tinker (`php artisan tinker`) uses PsySH. If a privileged user runs Tinker while their shell is in an attacker-writable directory, the `.psysh.php` auto-load behavior can be abused in the same way to execute attacker-controlled code under the victim’s privileges. Versions 0.11.23 and 0.12.19 patch the issue.",
  "datePublished": "Jan 30, 2026, 8:12:48 PM",
  "dateUpdated": "Feb 2, 2026, 3:45:55 PM",
  "baseScore": 6.7,
  "baseScoreVersion": "3.1",
  "baseScoreVector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:H",
  "references": [
    "https://github.com/bobthecow/psysh/security/advisories/GHSA-4486-gxhx-5mg7",
    "https://github.com/bobthecow/psysh/releases/tag/v0.11.23",
    "https://github.com/bobthecow/psysh/releases/tag/v0.12.19"
  ],
  "aliases": [
    "CVE-2026-25129"
  ],
  "assigner": "GitHub_M",
  "epss": 0.01,
  "enisaIdProduct": [
    {
      "id": "04ef00c7-c73a-36c2-88d0-97c95c2c8004",
      "product": {
        "name": "psysh"
      },
      "product_version": "0.12.0, < 0.12.19"
    },
    {
      "id": "78c362ff-89f1-3bad-9692-2ab2235427e7",
      "product": {
        "name": "psysh"
      },
      "product_version": "< 0.11.23"
    }
  ],
  "enisaIdVendor": [
    {
      "id": "19ac35ad-0630-348e-ba31-eea848cc580a",
      "vendor": {
        "name": "bobthecow"
      }
    }
  ]
}