{
  "id": "EUVD-2026-5304",
  "enisaUuid": "e971e28d-4efe-3724-8fb1-e697f4238136",
  "description": "continuwuity is a Matrix homeserver written in Rust. This vulnerability allows an attacker with a malicious remote server to cause the local server to sign an arbitrary event upon user interaction. Upon a user account leaving a room (rejecting an invite), joining a room or knocking on a room, the victim server may ask a remote server for assistance. If the victim asks the attacker server for assistance the attacker is able to provide an arbitrary event, which the victim will sign and return to the attacker. For the /leave endpoint, this works for any event with a supported room version, where the origin and origin_server_ts is set by the victim. For the /join endpoint, an additionally victim-set content field in the format of a join membership is needed. For the /knock endpoint, an additional victim-set content field in the format of a knock membership and a room version not between 1 and 6 is needed. This was exploited as a part of a larger chain against the continuwuity.org homeserver. This vulnerability affects all Conduit-derived servers. This vulnerability is fixed in Continuwuity 0.5.1, Conduit 0.10.11, Grapevine 0aae932b, and Tuwunel 1.4.9.",
  "datePublished": "Feb 2, 2026, 6:56:27 PM",
  "dateUpdated": "Feb 3, 2026, 2:53:20 PM",
  "baseScore": 9.3,
  "baseScoreVersion": "4.0",
  "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:L/SI:L/SA:H",
  "references": [
    "https://github.com/continuwuity/continuwuity/security/advisories/GHSA-m5p2-vccg-8c9v",
    "https://forgejo.ellis.link/continuwuation/continuwuity/commit/12aecf809172205436c852a1eaf268c1a2c3a900"
  ],
  "aliases": [
    "CVE-2026-24471"
  ],
  "assigner": "GitHub_M",
  "epss": 0.0,
  "enisaIdProduct": [
    {
      "id": "6087cd35-de4f-30f5-a69f-34bee68272d1",
      "product": {
        "name": "continuwuity"
      },
      "product_version": "< 0.5.1"
    }
  ],
  "enisaIdVendor": [
    {
      "id": "5cb00376-2f70-3b76-a239-8570eefb2061",
      "vendor": {
        "name": "continuwuity"
      }
    }
  ]
}