{
  "id": "EUVD-2026-5405",
  "enisaUuid": "ee5b8934-ff53-3f62-b0f7-62e3c9603f3d",
  "description": "The NixOs Odoo package is an open source ERP and CRM system. From 21.11 to before 25.11 and 26.05, every NixOS based Odoo setup publicly exposes the database manager without any authentication. This allows unauthorized actors to delete and download the entire database, including Odoos file store. Unauthorized access is evident from http requests. If kept, searching access logs and/or Odoos log for requests to /web/database can give indicators, if this has been actively exploited. The database manager is a featured intended for development and not meant to be publicly reachable. On other setups, a master password acts as 2nd line of defence. However, due to the nature of NixOS, Odoo is not able to modify its own configuration file and thus unable to persist the auto-generated password. This also applies when manually setting a master password in the web-UI. This means, the password is lost when restarting Odoo. When no password is set, the user is prompted to set one directly via the database manager. This requires no authentication or action by any authorized user or the system administrator. Thus, the database is effectively world readable by anyone able to reach Odoo. This vulnerability is fixed in 25.11 and 26.05.",
  "datePublished": "Feb 2, 2026, 10:47:50 PM",
  "dateUpdated": "Feb 4, 2026, 4:53:13 PM",
  "baseScore": 9.1,
  "baseScoreVersion": "3.1",
  "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:H",
  "references": [
    "https://github.com/NixOS/nixpkgs/security/advisories/GHSA-cwmq-6wv5-f3px",
    "https://github.com/NixOS/nixpkgs/pull/485310",
    "https://github.com/NixOS/nixpkgs/pull/485454"
  ],
  "aliases": [
    "CVE-2026-25137"
  ],
  "assigner": "GitHub_M",
  "epss": 0.0,
  "enisaIdProduct": [
    {
      "id": "fb6ad97e-3b4a-3a6e-bdf5-d13dbb77388e",
      "product": {
        "name": "nixpkgs"
      },
      "product_version": "21.11, < 25.11"
    }
  ],
  "enisaIdVendor": [
    {
      "id": "d20fa386-083b-361d-abc0-b0a380734e0f",
      "vendor": {
        "name": "NixOS"
      }
    }
  ]
}