{
  "id": "EUVD-2026-6097",
  "enisaUuid": "228cb74c-ff4f-3bcb-b456-099db40c8fb0",
  "description": "Emails sent by pretix can utilize placeholders that will be filled with customer data. For example, when {name}\n is used in an email template, it will  be replaced with the buyer's \nname for the final email. This mechanism contained two security-relevant\n bugs:\n\n\n\n  *  \nIt was possible to exfiltrate information about the pretix system through specially crafted placeholder names such as {{event.__init__.__code__.co_filename}}.\n This way, an attacker with the ability to control email templates \n(usually every user of the pretix backend) could retrieve sensitive \ninformation from the system configuration, including even database \npasswords or API keys. pretix does include mechanisms to prevent the usage of such \nmalicious placeholders, however due to a mistake in the code, they were \nnot fully effective for the email subject.\n\n\n\n\n  *  \nPlaceholders in subjects and plain text bodies of emails were \nwrongfully evaluated twice. Therefore, if the first evaluation of a \nplaceholder again contains a placeholder, this second placeholder was \nrendered. This allows the rendering of placeholders controlled by the \nticket buyer, and therefore the exploitation of the first issue as a \nticket buyer. Luckily, the only buyer-controlled placeholder available \nin pretix by default (that is not validated in a way that prevents the \nissue) is {invoice_company}, which is very unusual (but not\n impossible) to be contained in an email subject template. In addition \nto broadening the attack surface of the first issue, this could \ntheoretically also leak information about an order to one of the \nattendees within that order. However, we also consider this scenario \nvery unlikely under typical conditions.\n\n\nOut of caution, we recommend that you rotate all passwords and API keys contained in your  pretix.cfg https://docs.pretix.eu/self-hosting/config/  file.",
  "datePublished": "Feb 16, 2026, 10:15:09 AM",
  "dateUpdated": "Feb 16, 2026, 10:15:09 AM",
  "baseScore": 7.5,
  "baseScoreVersion": "4.0",
  "baseScoreVector": "CVSS:4.0/AV:N/AC:H/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:H/E:P/RE:L/U:Red",
  "references": [
    "https://pretix.eu/about/en/blog/20260216-release-2026-1-1/"
  ],
  "aliases": [
    "CVE-2026-2415"
  ],
  "assigner": "rami.io",
  "epss": 0.0,
  "enisaIdProduct": [
    {
      "id": "4f2e7a10-477a-474b-b575-665c469949bb",
      "product": {
        "name": "pretix"
      },
      "product_version": "2025.10.0 <2026.1.0"
    },
    {
      "id": "5958d149-5e86-4e12-b302-281f26668223",
      "product": {
        "name": "pretix"
      },
      "product_version": "2025.9.0 <2025.10.0"
    },
    {
      "id": "7d5a1158-0ab9-4407-b94a-a07c8b2197b9",
      "product": {
        "name": "pretix"
      },
      "product_version": "2026.1.0 <2026.1.1"
    },
    {
      "id": "f7d52e29-d9ae-4a62-9598-0cec6ea41216",
      "product": {
        "name": "pretix"
      },
      "product_version": "4.16.0 <2025.9.0"
    }
  ],
  "enisaIdVendor": [
    {
      "id": "ecfef174-826b-49f2-baff-5f48c320940e",
      "vendor": {
        "name": "pretix"
      }
    }
  ]
}