{
  "id": "EUVD-2026-3193",
  "enisaUuid": "345150b7-c45b-3243-9f26-d0a7c2731622",
  "description": "1Panel is an open-source, web-based control panel for Linux server management. A stored Cross-Site Scripting (XSS) vulnerability exists in the 1Panel App Store when viewing application details. Malicious scripts can execute in the context of the user’s browser, potentially compromising session data or sensitive system interfaces. All versions of 1Panel up to and including v1.10.33-lts and v2.0.16 are affected. An attacker could publish a malicious application that, when loaded by users (locally or remotely), can execute arbitrary scripts. This may result in theft of user cookies, unauthorized access to system functions, or other actions that compromise the confidentiality, integrity, and availability of the system. The vulnerability is caused by insufficient sanitization of content rendered by the MdEditor component with the `previewOnly` attribute enabled. Specifically, the App Store renders application README content without proper XSS protection, allowing script execution during content rendering; and similar issues exist in system upgrade-related components, which can be fixed by implementing proper XSS sanitization in the MdEditor component. These vulnerabilities can be mitigated by applying proper XSS protection and sanitization when rendering content in the MdEditor component. Safe versions with a patch incorporated are v1.10.34-lts and v2.0.17.",
  "datePublished": "Jan 18, 2026, 10:10:59 PM",
  "dateUpdated": "Jan 20, 2026, 8:07:16 PM",
  "baseScore": 6.4,
  "baseScoreVersion": "3.1",
  "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:H/UI:R/S:U/C:H/I:H/A:H",
  "references": [
    "https://github.com/1Panel-dev/1Panel/security/advisories/GHSA-mg24-6h5c-9q42"
  ],
  "aliases": [
    "CVE-2026-23525"
  ],
  "assigner": "GitHub_M",
  "epss": 0.06,
  "enisaIdProduct": [
    {
      "id": "2e79a977-96ad-3faa-ba35-ded78061d9fc",
      "product": {
        "name": "1Panel"
      },
      "product_version": "< 1.10.34"
    },
    {
      "id": "519f248b-939f-350a-83b8-075be9084772",
      "product": {
        "name": "1Panel"
      },
      "product_version": "2.0.0, < 2.0.17"
    }
  ],
  "enisaIdVendor": [
    {
      "id": "2d152a16-3ed9-3b0f-a516-06770f904f0d",
      "vendor": {
        "name": "1Panel-dev"
      }
    }
  ]
}