{
  "id": "EUVD-2026-4943",
  "enisaUuid": "470f473c-c814-3b49-8cb7-58620474b68f",
  "description": "gradle-completion provides Bash and Zsh completion support for Gradle. A command injection vulnerability was found in gradle-completion up to and including 9.3.0 that allows arbitrary code execution when a user triggers Bash tab completion in a project containing a malicious Gradle build file. The `gradle-completion` script for Bash fails to adequately sanitize Gradle task names and task descriptions, allowing command injection via a malicious Gradle build file when the user completes a command in Bash (without them explicitly running any task in the build). For example, given a task description that includes a string between backticks, then that string would be evaluated as a command when presenting the task description in the completion list. While task execution is the core feature of Gradle, this inherent execution may lead to unexpected outcomes. The vulnerability does not affect zsh completion. The first patched version is 9.3.1. As a workaround, it is possible and effective to temporarily disable bash completion for Gradle by removing `gradle-completion` from `.bashrc` or `.bash_profile`.",
  "datePublished": "Jan 29, 2026, 9:47:16 PM",
  "dateUpdated": "Feb 2, 2026, 4:35:06 PM",
  "baseScore": 8.3,
  "baseScoreVersion": "4.0",
  "baseScoreVector": "CVSS:4.0/AV:L/AC:L/AT:N/PR:H/UI:A/VC:H/VI:H/VA:H/SC:N/SI:H/SA:N",
  "references": [
    "https://github.com/gradle/gradle-completion/security/advisories/GHSA-qggc-44r3-cjgv",
    "https://github.com/gradle/gradle-completion/commit/ecacc32bb882210e5d37cd79a74de1af0d0ccad7"
  ],
  "aliases": [
    "CVE-2026-25063"
  ],
  "assigner": "GitHub_M",
  "epss": 0.13,
  "enisaIdProduct": [
    {
      "id": "53889fef-c95a-3d24-9f2e-82bec003d7bb",
      "product": {
        "name": "gradle-completion"
      },
      "product_version": "< 9.3.1"
    }
  ],
  "enisaIdVendor": [
    {
      "id": "a8b8ac68-0a3a-38cc-abc3-5a7be4291402",
      "vendor": {
        "name": "gradle"
      }
    }
  ]
}