{
  "id": "EUVD-2026-4877",
  "enisaUuid": "4dfd864b-712f-3a60-a0f5-ad5139b17638",
  "description": "OpenProject is an open-source, web-based project management software. To enable the real time collaboration on documents, OpenProject 17.0 introduced a synchronization server. The OpenPrioject backend generates an authentication token that is currently valid for 24 hours, encrypts it with a shared secret only known to the synchronization server. The frontend hands this encrypted token and the backend URL over to the synchronization server to check user's ability to work on the document and perform intermittent saves while editing. The synchronization server does not properly validate the backend URL and sends a request with the decrypted authentication token to the endpoint that was given to the server. An attacker could use this vulnerability to decrypt a token that he intercepted by other means to gain an access token to interact with OpenProject on the victim's behalf. This vulnerability was introduced with OpenProject 17.0.0 and was fixed in 17.0.2. As a workaround, disable the collaboration feature via Settings -> Documents -> Real time collaboration -> Disable. Additionally the `hocuspocus` container should also be disabled.",
  "datePublished": "Jan 28, 2026, 6:07:02 PM",
  "dateUpdated": "Jan 28, 2026, 6:31:44 PM",
  "baseScore": 8.9,
  "baseScoreVersion": "3.1",
  "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:L",
  "references": [
    "https://github.com/opf/openproject/security/advisories/GHSA-r854-p5qj-x974"
  ],
  "aliases": [
    "CVE-2026-24772"
  ],
  "assigner": "GitHub_M",
  "epss": 0.02,
  "enisaIdProduct": [
    {
      "id": "296fa5be-1154-39b7-b6dc-bde4986fbd41",
      "product": {
        "name": "openproject"
      },
      "product_version": "OpenProject  17.0.0, < 17.0.2"
    },
    {
      "id": "e20598fa-354a-33a5-9647-f98c30861ee1",
      "product": {
        "name": "openproject"
      },
      "product_version": "openproject/hocuspocus < 17.0.2"
    }
  ],
  "enisaIdVendor": [
    {
      "id": "cd3d9178-bdf3-3bc7-b370-738aa8ec47c3",
      "vendor": {
        "name": "opf"
      }
    }
  ]
}