{
  "id": "EUVD-2025-206329",
  "enisaUuid": "dc91f994-01a7-3fbc-8a51-37de72413077",
  "description": "NervesHub is a web service that allows users to manage over-the-air (OTA) firmware updates of devices in the field. A vulnerability present starting in version 1.0.0 and prior to version 2.3.0 allowed attackers to brute-force user API tokens due to the predictable format of previously issued tokens. Tokens included user-identifiable components and were not cryptographically secure, making them susceptible to guessing or enumeration. The vulnerability could have allowed unauthorized access to user accounts or API actions protected by these tokens. A fix is available in version 2.3.0 of NervesHub. This version introduces strong, cryptographically-random tokens using `:crypto.strong_rand_bytes/1`, hashing of tokens before database storage to prevent misuse even if the database is compromised, and context-aware token storage to distinguish between session and API tokens. There are no practical workarounds for this issue other than upgrading. In sensitive environments, as a temporary mitigation,\nfirewalling access to the NervesHub server can help limit exposure until an upgrade is possible.",
  "datePublished": "Jan 22, 2026, 2:57:00 PM",
  "dateUpdated": "Jan 22, 2026, 4:16:06 PM",
  "baseScore": 9.5,
  "baseScoreVersion": "4.0",
  "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:P/PR:N/UI:N/VC:H/VI:H/VA:N/SC:H/SI:H/SA:H",
  "references": [
    "https://github.com/nerves-hub/nerves_hub_web/security/advisories/GHSA-m9vj-776q-vc8m",
    "https://github.com/nerves-hub/nerves_hub_web/pull/2024",
    "https://github.com/nerves-hub/nerves_hub_web/releases/tag/v2.3.0"
  ],
  "aliases": [
    "CVE-2025-64097"
  ],
  "assigner": "GitHub_M",
  "epss": 0.05,
  "enisaIdProduct": [
    {
      "id": "e30775e0-70cf-391d-8a70-898a3ed08d02",
      "product": {
        "name": "nerves_hub_web"
      },
      "product_version": "1.0.0, < 2.3.0"
    }
  ],
  "enisaIdVendor": [
    {
      "id": "55b3a9ca-61e4-3395-98ce-b443b794d706",
      "vendor": {
        "name": "nerves-hub"
      }
    }
  ]
}